Revit 2027 API
ValueAtPoint(ValueAtPoint) Constructor
 Creates a copy of the given ValueAtPoint instance.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ValueAtPoint(
	ValueAtPoint otherObject
)
Public Sub New (
	otherObject As ValueAtPoint
)
public:
ValueAtPoint(
	ValueAtPoint^ otherObject
)
new :
        otherObject : ValueAtPoint -> ValueAtPoint
Parameters
otherObject ValueAtPoint
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ValueAtPoint Class
ValueAtPoint Overload
Autodesk.Revit.DB.Analysis Namespace